In [1]:
import numpy  as np
import pandas as pd

# **Accés aux données multi indéex (part.2)**

In [2]:
data = {'Ville'     :['Paris','Paris','Paris','Marseille','Marseille','Marseille','Lyon','Lyon','Lyon','Touluose','Touluose','Touluose'],
        'Année'     :[2018,2013,2008,2018,2013,2008,2018,2013,2008,2018,2013,2008],
        'Population':[2175601,229621,221197,868277,855393,851420,518630,500715,474946,486828,458298,439553]
}

In [3]:
df = pd.DataFrame(data,columns = ['Ville','Année','Population']) # Les données, puis les 3 clés
df

        Ville  Année  Population
0       Paris   2018     2175601
1       Paris   2013      229621
2       Paris   2008      221197
3   Marseille   2018      868277
4   Marseille   2013      855393
5   Marseille   2008      851420
6        Lyon   2018      518630
7        Lyon   2013      500715
8        Lyon   2008      474946
9    Touluose   2018      486828
10   Touluose   2013      458298
11   Touluose   2008      439553

In [4]:
# Quelle règle pour les index ?
df.index

RangeIndex(start=0, stop=12, step=1)

In [5]:
# Créer une hiérarchie de niveau
df.set_index(['Ville','Année'])

                 Population
Ville     Année
Paris     2018      2175601
          2013       229621
          2008       221197
Marseille 2018       868277
          2013       855393
          2008       851420
Lyon      2018       518630
          2013       500715
          2008       474946
Touluose  2018       486828
          2013       458298
          2008       439553

In [6]:
df.index

RangeIndex(start=0, stop=12, step=1)

In [7]:
df.set_index(['Ville','Année'],inplace=True)
df

                 Population
Ville     Année
Paris     2018      2175601
          2013       229621
          2008       221197
Marseille 2018       868277
          2013       855393
          2008       851420
Lyon      2018       518630
          2013       500715
          2008       474946
Touluose  2018       486828
          2013       458298
          2008       439553

In [8]:
# Combien d'habitants en 2018 à Marseille
df.loc['Marseille',2018]

Population    868277
Name: (Marseille, 2018), dtype: int64

In [9]:
# La population de Paris
df.loc['Paris']

       Population
Année
2018      2175601
2013       229621
2008       221197

In [10]:
# Paris en 2018 et Marseille en 2008
df.loc[[('Paris',2018),('Marseille',2008)]]

                 Population
Ville     Année
Paris     2018      2175601
Marseille 2008       851420

In [11]:
# L'année 2018 (il faut une clé et préciser le niveau)
df.xs(key = 2018 , level = 'Année')

           Population
Ville
Paris         2175601
Marseille      868277
Lyon           518630
Touluose       486828

In [12]:
# Idem en affichant l'année
df.xs(key = 2018 , level = 'Année' , drop_level = False)

                 Population
Ville     Année
Paris     2018      2175601
Marseille 2018       868277
Lyon      2018       518630
Touluose  2018       486828